"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь:
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def user_age(age):
    age = int(input('Укажите свой возраст: '))
    if age <= 6:
        return 'Учиться в детском саду'
    if age <= 17:
        return 'Учится в школе'
    if age <= 22:
        return 'Учится ВУЗ'

    return 'Иди работай'


if __name__ == "__main__":
    print(user_age('age'))
